#+STARTUP: inlineimages
#+PROPERTY: engine postgresql
#+PROPERTY: dbhost localhost
#+PROPERTY: database webar_marty
#+OPTIONS: ^:nil

*** groovy
    #+Name: data
    #+BEGIN_SRC groovy
    [foo:5]
    #+END_SRC

    #+BEGIN_SRC groovy :noweb yes
    <<data>>
    #+END_SRC

    #+RESULTS:
    : [foo:5]

*** CCP report project
The old logi xml format for goCollection bookmarks have ~DataLayer~
elements that have ~Source~ attributes that combine the schema and table
name. ie ~<DataLayer ... Source="ccp_re.demographic_phone" ...>~

The new format demands the source to be split up and have a seperate
~Schema~ attribute so that it looks like:
~<DataLayer ... Schema="ccp_re" Source="demographic_phone" ...>~

Also spaces are escaped for certain attributes in the xml with \under{}x0020\under{}

To start from the top, unzip the file overwriting everything:
#+BEGIN_SRC bash
  cd /cygdrive/c/var/portal/documents/logi/goBookmarks/CCP/
  rm *.xml
  unzip -qo Analytics-20180730030000.zip
#[[shell:cd%20/cygdrive/c/var/portal/documents/logi/goBookmarks/CCP/;echo%20goCollection*.xml|wc%20-w][Count of reports]]
  echo goCollection*.xml|wc -w|xargs printf "%s files extracted"
#+END_SRC

#+RESULTS:
: 152 files extracted

This formats all the xml files:
#+BEGIN_SRC bash :results output raw :async
  cd /cygdrive/c/var/portal/documents/logi/goBookmarks/CCP/
  for f in *.xml
  do 
    xmlstarlet format "$f" | sponge "$f"
  done
#+END_SRC

#+RESULTS:

This changes all the xml files in-place
#+BEGIN_SRC bash :results silent
  cd /cygdrive/c/var/portal/documents/logi/goBookmarks/CCP/
  sed -i 's/\(<DataLayer[^>]*\) Source="\([^"]*\)\.\([^"]*\)"/\1 Schema="\2" Source="\3"/g' *.xml
  sed -i ":a s/\(\(DefaultValue\|ID\|rdAgAggrColumn\|rdAgColumnID\|rdAgGroupColumn\|rdAgOrderColumn\|rdAgRemovingColumn\)=.[a-zA-Z0-9_]*\) /\1_x0020_/g;ta" *.xml
  # Same as above for DataColumn|ColumnName, but don't do it for SqlColumn tags
  sed -i ':a /<SqlColumn /!s/\(\(DataColumn\)=.[a-zA-Z0-9_]*\) /\1_x0020_/g;ta' *.xml
  sed -i ':a /<StaticDataRow /!s/\(\(ColumnName\)=.[a-zA-Z0-9_]*\) /\1_x0020_/g;ta' *.xml
  sed -i '/<StaticDataRow /s/ DataColumn="[^"]*"\(.*\)DataColumnCaption="\[\([^]]*\)\]"/ DataColumn="\2"\1DataColumnCaption="\[\2\]"/g' *.xml #"
  sed -i 's/ Schema="ccp"/ Schema="ccp_re"/g' *.xml
#+END_SRC


#+RESULTS:
:RESULTS:
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_6fc35548-9c38-4380-97bc-94431eb8e21b.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_9454759c-1eaa-430f-a4e8-c2f9e980aee0.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_a09c2af9-1648-4cd4-be21-f6fef1fad7df.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_a5294f6d-bf94-4817-9f15-8148454de80b.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_e44bb91a-3fdd-4c3c-9b62-f4127b49b099.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_e787598f-1f10-4993-9f61-f59cb576064e.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\105419goCollection_eef3fb47-42dd-4b7f-875b-3339b4ba9301.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_09cd4ced-bb9b-4577-aa6b-fe43b87dd1b7.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_185a9e74-7545-407c-9d18-dbf819f57b46.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_1f6860d2-00f1-4181-b1e9-764292234244.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_2187cd54-f136-44e7-91bb-f8fc03210541.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_23e44f64-dced-4bd8-a6f5-9bb0e8611202.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_29aaa42a-40d6-4570-92a9-90514be0c21e.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_3514aada-6d49-4b1f-a672-1c9a7a9b535a.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_3b700e02-ee2f-4b59-b61a-abe68bcc0021.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_4766803e-e63e-45a3-94d6-20d727d02590.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_47fcb012-9f6c-42a1-bb6b-0b6ed04cc302.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_4b9dc940-07e1-4da9-812b-2f43b82b58fc.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_56b4d45c-7536-4bc3-bdde-b62e6f658175.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_5da77f41-4a37-4344-8bc0-85aad943bbc0.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_5f74f025-d801-48e2-814b-eed026810cae.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_61ae836a-3553-43ae-8189-a49b17b1aca4.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_620f4dc7-dd2e-4f7c-872b-d569c6c00eae.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_62806583-4c23-47ad-bd0f-67c4ef52bea5.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_695ad503-8af4-40a0-abee-7e3977b9c5b3.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_6b002d57-7833-4367-afbf-6fd264748b3d.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_718af0b6-9f5a-4848-b9cf-1ea6e7054461.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_7f5f8786-6b15-46b6-a8e3-b355f9d7fc75.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_83c053ca-6d8c-42ee-92a0-86c023287669.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_840a385b-c5a9-4a16-9f2d-d1495b9d6ed6.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_8a78107f-d5fb-4b62-9fa9-cbe7215695fc.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_935b39ab-90f5-4c55-95bf-6685870dd2a5.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_96d8d644-de7f-4c90-8083-3641b223472b.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_adddae3c-32b2-4e49-b83d-5b4013ea2412.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_ae29f3b4-63cd-40ff-b713-84f21d4b2861.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_b3482fbf-4e55-44ed-8334-ab4d0867eb2a.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_b47df239-7fa4-477a-94dd-67fb777c040a.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_bb8f446e-39d9-4128-a557-8d584118331f.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_c7024c40-eb77-488a-8bde-e4abcec3ca9b.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_cb9abed3-94e1-40d5-acca-7bc4bc4a99db.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_d1aa3936-2d90-49cd-9d8a-e2580a3f4b93.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_d1d7abee-2c19-4761-92f1-d5d893c19382.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_d3c5a05d-b953-4850-81ea-314d1b5dd7d7.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_dab7457c-79cd-42ae-baf9-e106da0233b8.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_e5cc4f15-2a37-494e-b45d-5f4abc65a2d9.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_ec7c1358-9a54-4d78-b1b3-9803b8fa40fc.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_ee78564d-f9af-4339-a6b9-cdf3536912bf.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_f860480f-81ab-40b7-b84e-bda69a18644e.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goCollection_fad3200a-5ba6-4e53-9f04-46d4ce589d41.xml
file:C:\var\portal\documents\logi\goBookmarks\CCP\goGallery.xml
:END:

List out the files
#+BEGIN_SRC bash :results raw drawer
  /usr/bin/find /cygdrive/c/var/portal/documents/logi/goBookmarks/CCP/*.xml -print0|xargs -0 cygpath -w|sed 's/^/file:/g'
#+END_SRC


This brings in our backed up file
#+BEGIN_SRC bash :results silent
  cd /cygdrive/c/var/portal/documents/logi/goBookmarks/
  cp "goCollection_57c29c72-bb8d-4605-9cbf-d61263c44b3e - Copy.xml" CCP/goCollection_57c29c72-bb8d-4605-9cbf-d61263c44b3e.xml
  sed -i '628a\
  <Bookmark Report="InfoGo.goAnalysisGrid" Name="" CustomColumn1="" CustomColumn2="" BookmarkID="57c29c72-bb8d-4605-9cbf-d61263c44b3e" ExtraFile="goCollection_57c29c72-bb8d-4605-9cbf-d61263c44b3e.xml" Description="CCP_GENERATED" SaveTime="2018-06-22T14:28:41-07:00">\
    <RequestParameters rdAgLoadSaved="goCollection_57c29c72-bb8d-4605-9cbf-d61263c44b3e.xml" />\
    <SessionParameters />\
  </Bookmark>' CCP/goCollection.xml
#+END_SRC

An example file to look at:
Client Inventory Summary
column order: 
Assigned Date, Current Balance, Calls, Debt ID, Last Contact Date, Mobile Phone Numbers, Client Name

file:C:/var/portal/documents/logi/goBookmarks/CCP/goCollection_f997e11c-9ff0-42a2-8135-e8226893615a.xml
** Liquibase: Waiting for changelog lock
This error occurs if liquibase does not exit cleanly, the lock row may
be left as locked. This might due to stopping or killing the tomcat
before liquibase releases the lock.

Execute the below SQL to clear the lock
#+BEGIN_SRC sql :engine postgresql :dbhost localhost :database webar_marty
UPDATE DATABASECHANGELOGLOCK SET LOCKED = 'f';
#+END_SRC

#+RESULTS:
| UPDATE 1 |
|----------|

